{
    "name": "Rohit Bharat Akulwar",
    "title": "Software Developer",
    "email": "rohitakulwar380@gmail.com",
    "phone": "+917020161320",
    "location": "Pune, India",
    "linkedin_github_handle": "RohitAkulwar380",
    "objective": "Aspiring software developer with a strong focus on AI applications and automation systems. Detail-oriented problem solver with excellent analytical thinking and adaptability in rapidly evolving tech environments. Experienced in workflow automation using n8n, creating intelligent pipelines that streamline complex processes. Actively exploring AI-driven image and video generation, with growing expertise in prompt engineering and model integration. Passionate about developing scalable AI solutions and leveraging automation to enhance productivity and creative workflows through collaborative innovation and continuous learning.",
    "education_1_degree": "Master of Computer Applications",
    "education_1_institution": "IMED, BHARTI VIDYAPEETH -MCA",
    "education_1_dates": "08/2024 - Present",
    "education_1_cgpa": 8.08,
    "education_2_degree": "Bachelor of Business Administration (Computer Applications)",
    "education_2_institution": "NESS WADIA COLLEGE OF COMMERCE",
    "education_2_dates": "06/2021 - 05/2024",
    "education_2_cgpa": 8.23,
    "education_3_degree": "Maharashtra State Board of Secondary & Higher Secondary Education",
    "education_3_institution": "NESS WADIA COLLEGE OF COMMERCE (JR. COLLEGE)",
    "education_3_dates": "07/2019 - 05/2021",
    "education_3_percentage": 78.83,
    "education_4_degree": "Maharashtra State Board of Secondary & Higher Secondary Education",
    "education_4_institution": "ERIN N. NAGARVALA DAY SCHOOL",
    "education_4_dates": "06/2005 - 05/2019",
    "education_4_percentage": 61.6,
    "technical_skill_1": "Python",
    "technical_skill_2": "Java",
    "technical_skill_3": "n8n/Automation",
    "technical_skill_4": "Kotlin",
    "technical_skill_5": "HTML/CSS",
    "technical_skill_6": "MySQL",
    "technical_skill_7": "Prompt Engineering",
    "technical_skill_8": "Git",
    "soft_skill_1": "Communication",
    "soft_skill_2": "Adaptability",
    "soft_skill_3": "Teamwork",
    "soft_skill_4": "Time Management",
    "project_1_title": "Automated Data Analytics Pipeline using n8n",
    "project_1_description": "Developed a comprehensive data analytics automation pipeline using n8n that integrates multiple APIs to collect, process, and analyze business data in real-time. Created automated data extraction workflows from various sources with advanced data transformation capabilities and dynamic report generation featuring interactive charts and visualizations.",
    "project_1_technologies": "n8n, Gemini API, AI Agent Integration, Data Visualization, Quickchart.io",
    "project_2_title": "AI Content Aggregation & Automation Pipeline",
    "project_2_description": "Built an AI-powered automated content aggregation and workflow system using n8n, leveraging RSS feeds and custom API integrations to scrape, filter, and organize real-time articles from multiple websites. Implemented intelligent content processing with NLP-based classification and topic extraction, enabling automated categorization into domains like finance, mental health, and tech. Designed a clean frontend in JSX to display categorized articles, trending topics, and workflow results in an intuitive dashboard.",
    "project_2_technologies": "n8n, RSS Feeds, Node.js, JSX Frontend, API Integrations, NLP-Based Classification, Automation Workflows, AI/LLM Processing",
    "project_3_title": "2D Game in Python - Pixel Fire",
    "project_3_description": "A 2D Indie Platformer built in Python using the PyGame Library. Includes multiple levels and stages with unique Boss Fights and their respective stages. Used Sprites and a Level Builder to build the World.",
    "project_3_technologies": "Python, PyGame",
    "project_4_title": "Full Stack E-commerce Website",
    "project_4_description": "A full-stack E-Commerce application built with the MERN stack and TypeScript. Includes a responsive customer storefront with a shopping cart, product filtering, and secure checkout, alongside a comprehensive Admin Dashboard for inventory and user management. Features JWT authentication, image uploads, and automated email notifications with a modern Neo-Brutalist UI.",
    "project_4_technologies": "React, Node.js, Express.js, MongoDB, TypeScript, Tailwind CSS, Vite"
}